src/cf/InformationRegisters/ПараметрыРаспознаванияРечи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыРаспознаванияРечи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПараметрыРаспознаванияРечи/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьБезопасно(ИмяФормы = "", Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = РегистрыСведений.ПараметрыРаспознаванияРечи.СоздатьМенеджерЗаписи();
	Менеджер.ИмяФормы = ИмяФормы;
	Менеджер.Пользователь = Пользователь;
	Менеджер.Прочитать();
	
	ТекущиеПараметры = Менеджер.Данные.Получить();
	Результат = ПараметрыПоУмолчанию();
	Если ТекущиеПараметры = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Результат, ТекущиеПараметры);
	Возврат Результат;
	
КонецФункции

Процедура Сохранить(Данные, ИмяФормы = "", Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ТекущиеПараметры = ПолучитьБезопасно(ИмяФормы, Пользователь);
	ЗаполнитьЗначенияСвойств(ТекущиеПараметры, Данные);
	
	Менеджер = РегистрыСведений.ПараметрыРаспознаванияРечи.СоздатьМенеджерЗаписи();
	Менеджер.ИмяФормы = ИмяФормы;
	Менеджер.Пользователь = Пользователь;
	Менеджер.Данные = Новый ХранилищеЗначения(ТекущиеПараметры);
	Менеджер.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ВариантИспользования", РаботаСРечьюБМОСервер.ВариантИспользованияРасположенияРаботыСРечью().Авто);
	
	Результат.Вставить("КодЯзыка");
	Результат.Вставить("Акустика");
	Результат.Вставить("Грамматика");
	Результат.Вставить("Версия");
	
	Результат.Вставить("ДополнительныеГрамматики", Новый Массив);
	Результат.Вставить("ИспользоватьТолькоДополнительныеГрамматики", Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
